Model: "custom_cnn"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_54 (InputLayer)        [(None, 256, 256, 3)]     0         
_________________________________________________________________
conv_0_0 (Conv2D)            (None, 254, 254, 32)      896       
_________________________________________________________________
bn_0_0 (BatchNormalization)  (None, 254, 254, 32)      128       
_________________________________________________________________
mp_0 (MaxPooling2D)          (None, 127, 127, 32)      0         
_________________________________________________________________
dropout_0 (Dropout)          (None, 127, 127, 32)      0         
_________________________________________________________________
conv_1_0 (Conv2D)            (None, 125, 125, 64)      18496     
_________________________________________________________________
bn_1_0 (BatchNormalization)  (None, 125, 125, 64)      256       
_________________________________________________________________
mp_1 (MaxPooling2D)          (None, 62, 62, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 62, 62, 64)        0         
_________________________________________________________________
conv_2_0 (Conv2D)            (None, 60, 60, 128)       73856     
_________________________________________________________________
bn_2_0 (BatchNormalization)  (None, 60, 60, 128)       512       
_________________________________________________________________
mp_2 (MaxPooling2D)          (None, 30, 30, 128)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 30, 30, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 115200)            0         
_________________________________________________________________
output (Dense)               (None, 1)                 115201    
=================================================================
Total params: 209,345
Trainable params: 208,897
Non-trainable params: 448
_________________________________________________________________
