Model: "custom/cnn_in.256.256.3_cl.2.1_f.32_ck.3.3_p.max_ps.2.2_pstr.2.2_dp.0.25"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 256, 256, 3)]     0         
_________________________________________________________________
conv_0_0 (Conv2D)            (None, 256, 256, 32)      896       
_________________________________________________________________
conv_0_0_relu (Activation)   (None, 256, 256, 32)      0         
_________________________________________________________________
mp_0 (MaxPooling2D)          (None, 128, 128, 32)      0         
_________________________________________________________________
dropout_0 (Dropout)          (None, 128, 128, 32)      0         
_________________________________________________________________
conv_1_0 (Conv2D)            (None, 128, 128, 64)      18496     
_________________________________________________________________
conv_1_0_relu (Activation)   (None, 128, 128, 64)      0         
_________________________________________________________________
mp_1 (MaxPooling2D)          (None, 64, 64, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 64, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 262144)            0         
_________________________________________________________________
output (Dense)               (None, 1)                 262145    
=================================================================
Total params: 281,537
Trainable params: 281,537
Non-trainable params: 0
_________________________________________________________________
