Model: "custom/cnn_in.256.256.3_cl.5.1_f.32_ck.3.3_bn_p.avg_ps.2.2_pstr.2.2_dp.0.25"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 256, 256, 3)]     0         
_________________________________________________________________
conv_0_0 (Conv2D)            (None, 256, 256, 32)      896       
_________________________________________________________________
bn_0_0 (BatchNormalization)  (None, 256, 256, 32)      128       
_________________________________________________________________
conv_0_0_relu (Activation)   (None, 256, 256, 32)      0         
_________________________________________________________________
mp_0 (AveragePooling2D)      (None, 128, 128, 32)      0         
_________________________________________________________________
dropout_0 (Dropout)          (None, 128, 128, 32)      0         
_________________________________________________________________
conv_1_0 (Conv2D)            (None, 128, 128, 64)      18496     
_________________________________________________________________
bn_1_0 (BatchNormalization)  (None, 128, 128, 64)      256       
_________________________________________________________________
conv_1_0_relu (Activation)   (None, 128, 128, 64)      0         
_________________________________________________________________
mp_1 (AveragePooling2D)      (None, 64, 64, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 64, 64)        0         
_________________________________________________________________
conv_2_0 (Conv2D)            (None, 64, 64, 128)       73856     
_________________________________________________________________
bn_2_0 (BatchNormalization)  (None, 64, 64, 128)       512       
_________________________________________________________________
conv_2_0_relu (Activation)   (None, 64, 64, 128)       0         
_________________________________________________________________
mp_2 (AveragePooling2D)      (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 32, 128)       0         
_________________________________________________________________
conv_3_0 (Conv2D)            (None, 32, 32, 256)       295168    
_________________________________________________________________
bn_3_0 (BatchNormalization)  (None, 32, 32, 256)       1024      
_________________________________________________________________
conv_3_0_relu (Activation)   (None, 32, 32, 256)       0         
_________________________________________________________________
mp_3 (AveragePooling2D)      (None, 16, 16, 256)       0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 16, 16, 256)       0         
_________________________________________________________________
conv_4_0 (Conv2D)            (None, 16, 16, 512)       1180160   
_________________________________________________________________
bn_4_0 (BatchNormalization)  (None, 16, 16, 512)       2048      
_________________________________________________________________
conv_4_0_relu (Activation)   (None, 16, 16, 512)       0         
_________________________________________________________________
mp_4 (AveragePooling2D)      (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 8, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 32768)             0         
_________________________________________________________________
output (Dense)               (None, 1)                 32769     
=================================================================
Total params: 1,605,313
Trainable params: 1,603,329
Non-trainable params: 1,984
_________________________________________________________________
