Model: "custom_cnn"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_41 (InputLayer)        [(None, 256, 256, 3)]     0         
_________________________________________________________________
conv_0_0 (Conv2D)            (None, 254, 254, 32)      896       
_________________________________________________________________
conv_0_1 (Conv2D)            (None, 252, 252, 32)      9248      
_________________________________________________________________
mp_0 (MaxPooling2D)          (None, 126, 126, 32)      0         
_________________________________________________________________
conv_1_0 (Conv2D)            (None, 124, 124, 64)      18496     
_________________________________________________________________
conv_1_1 (Conv2D)            (None, 122, 122, 64)      36928     
_________________________________________________________________
mp_1 (MaxPooling2D)          (None, 61, 61, 64)        0         
_________________________________________________________________
conv_2_0 (Conv2D)            (None, 59, 59, 128)       73856     
_________________________________________________________________
conv_2_1 (Conv2D)            (None, 57, 57, 128)       147584    
_________________________________________________________________
mp_2 (MaxPooling2D)          (None, 28, 28, 128)       0         
_________________________________________________________________
conv_3_0 (Conv2D)            (None, 26, 26, 256)       295168    
_________________________________________________________________
conv_3_1 (Conv2D)            (None, 24, 24, 256)       590080    
_________________________________________________________________
mp_3 (MaxPooling2D)          (None, 12, 12, 256)       0         
_________________________________________________________________
conv_4_0 (Conv2D)            (None, 10, 10, 512)       1180160   
_________________________________________________________________
conv_4_1 (Conv2D)            (None, 8, 8, 512)         2359808   
_________________________________________________________________
mp_4 (MaxPooling2D)          (None, 4, 4, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 8192)              0         
_________________________________________________________________
output (Dense)               (None, 1)                 8193      
=================================================================
Total params: 4,720,417
Trainable params: 4,720,417
Non-trainable params: 0
_________________________________________________________________
