Model: "custom/cnn_in.256.256.3_cl.1.1_f.32_ck.3.3_p.max_ps.2.2_pstr.2.2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 256, 256, 3)]     0         
_________________________________________________________________
conv_0_0 (Conv2D)            (None, 256, 256, 32)      896       
_________________________________________________________________
conv_0_0_relu (Activation)   (None, 256, 256, 32)      0         
_________________________________________________________________
mp_0 (MaxPooling2D)          (None, 128, 128, 32)      0         
_________________________________________________________________
flatten (Flatten)            (None, 524288)            0         
_________________________________________________________________
output (Dense)               (None, 1)                 524289    
=================================================================
Total params: 525,185
Trainable params: 525,185
Non-trainable params: 0
_________________________________________________________________
