Model: "custom_cnn"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_42 (InputLayer)        [(None, 256, 256, 3)]     0         
_________________________________________________________________
conv_0_0 (Conv2D)            (None, 254, 254, 32)      896       
_________________________________________________________________
bn_0_0 (BatchNormalization)  (None, 254, 254, 32)      128       
_________________________________________________________________
mp_0 (MaxPooling2D)          (None, 127, 127, 32)      0         
_________________________________________________________________
flatten (Flatten)            (None, 516128)            0         
_________________________________________________________________
output (Dense)               (None, 1)                 516129    
=================================================================
Total params: 517,153
Trainable params: 517,089
Non-trainable params: 64
_________________________________________________________________
