Model: "custom_cnn"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_37 (InputLayer)        [(None, 256, 256, 3)]     0         
_________________________________________________________________
conv_0_0 (Conv2D)            (None, 254, 254, 32)      896       
_________________________________________________________________
conv_0_1 (Conv2D)            (None, 252, 252, 32)      9248      
_________________________________________________________________
mp_0 (MaxPooling2D)          (None, 126, 126, 32)      0         
_________________________________________________________________
flatten (Flatten)            (None, 508032)            0         
_________________________________________________________________
output (Dense)               (None, 1)                 508033    
=================================================================
Total params: 518,177
Trainable params: 518,177
Non-trainable params: 0
_________________________________________________________________
